{
  "title": "Northern Territory Government visa nomination | The Territory, Australia",
  "date": "2025-06-22",
  "content": "Update on NT General Skilled Migration (GSM) nomination applications for 2024-25\nLimited nominations available for onshore applicants with visa deadlines before 31 December 2025\nThe 2024-25 program year for the GSM program will end on 30 June 2025. Nomination applications for the 2025-26 program year will open once the NT has received its allocations from the Australian Government.\nMigrationNT has reserved limited subclass 491 nominations for eligible onshore applicants with certain visa deadlines falling before 31 December 2025. Those with such visa deadlines should lodge subclass 491 nomination applications without delay, and well ahead of 30 June 2025 as no applications can be accepted after that date, until the new program opens. The 2024-25 program remains suspended for other applicants at this time.\nFor detailed information, view\nthe update on NT GSM nomination applications for 2024-25\n.\nPlease note that we will not be able to guarantee nominations before visa deadlines.\nThose who are onshore and have visas expiring should seek professional advice on their visa options and ensure that they remain lawful in Australia.\nTo find work in the Northern Territory visit\nWorkerConnect\n.\nWhat is a Northern Territory Government nomination?\nAustralia's Northern Territory (NT) Government can nominate you for a skilled visa if you:\nmeet Australian Government’s standard requirements, and\nmeet NT Government’s nomination eligibility, and\ncommit to living and working in the Territory within your skilled occupation for at least three years upon the grant of your visa.\nWhat you need to know\nNT Government will decide whether you are offered a nomination.\nA condition of NT Government nomination is that you agree to work, live and settle for at least three years in the NT after your visa has been granted.",
  "url": "https://theterritory.com.au/migrate/migrate-to-work/northern-territory-government-visa-nomination",
  "hash": "2611830a01b35d81725218b3e3df5d1f"
}